import os

BASE_DIR = "/workspaces/template_pytorch/isee_dataset"

folders = ["11827",
                     "11875",
                     "11899",
                     "11909",
                     "11931",
                     "11936",
                     "11967",
                     "11991",
                     "12011",
                     "12021",
                     "11560",
                     "12036",
                     "12049",
                     "12080",
                     "12216",
                     "12241",
                     "12257",
                     "12205",
                     "12271",
                     "12277",
                     "12280",
                     "11117",
                     "12360",
                     "12381",
                     "12422",
                     "12489",
                     "12494",
                     "11130",
                     "12026",
                     "12738",
                     "11861",
                     "11884",
                     "11908",
                     "11793",
                     "11492",
                     "11777",
                     "11765",
                     "11131",
                     "11512",
                     "11520",
                     "12034",
                     "11169",
                     "11562",
                     "12082",
                     "11589",
                     "11195",
                     "11591",
                     "11257",
                     "11260",
                     "11598",
                     "12371",
                     "11271",
                     "11312",
                     "12396",
                     "11358",
                     "11363",
                     "11390",
                     "11393",
                     "11460",
                     "11486"
        ]

for folder in folders:
    path = os.path.join(BASE_DIR, folder)
    if not os.path.lexists(path):
        print(f"リンク自体が存在しない: {folder}")
    elif not os.path.exists(path):
        print(f"リンク切れ: {folder} -> {os.readlink(path)}")
    elif not os.path.isdir(path):
        print(f"リンク先がディレクトリでない: {folder}")
